eisup_2019_docmng_integration/src/InformationRegisters/ТекущаяРаботаПоЗаявкамКандидатов/ТекущаяРаботаПоЗаявкамКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущаяРаботаПоЗаявкамКандидатов</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗаявокКандидатов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаКандидата</name>
    <type>
      <types>CatalogRef.ЗаявкиКандидатов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/Встречи/Встречи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Встречи</name>
  <registerRecords>InformationRegister.ПланируемаяЗанятостьПомещений</registerRecords>
  <registerRecords>InformationRegister.ПериодыЗанятостиПомещений</registerRecords>
  <registerRecords>InformationRegister.СборДанныхДляПланированияЗанятостиФизлиц</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВстречаСКандидатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаКандидата</name>
    <type>
      <types>CatalogRef.ЗаявкиКандидатов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Catalogs/ЗаявкиКандидатов/ЗаявкиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиКандидатов</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.Важность</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗаявок</name>
    <type>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/НаборПерсоналаДополнительный/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Функция ПолучитьСписокВстречПоЗаявке(ЗаявкаКандидата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ЗаявкаКандидата);
	Запрос.УстановитьПараметр("ТекущаяДата",		ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Встречи.Комментарий,
	|	Встречи.Ссылка,
	|	Встречи.ДатаНачала КАК ДатаНачала,
	|	Встречи.ДатаОкончания
	|ИЗ
	|	Документ.Встречи КАК Встречи
	|ГДЕ
	|	Встречи.ЗаявкаКандидата = &ЗаявкаКандидата
	|	И Встречи.Проведен
	|	И Встречи.ДатаОкончания >= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ИзменитьСостояниеЗаявкиКандидата(ЗаявкаКандидата, СостояниеЗаявки) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТекущаяРаботаПоЗаявкамКандидатов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ОбщегоНазначенияЗК.ПолучитьРабочуюДату());
	НаборЗаписей.Отбор.ЗаявкаКандидата.Установить(ЗаявкаКандидата);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Строка = НаборЗаписей.Добавить();
		Строка.Период			= ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
		Строка.ЗаявкаКандидата	= ЗаявкаКандидата;
	Иначе
		Строка = НаборЗаписей[0];
	КонецЕсли;
	
	Строка.Состояние			= СостояниеЗаявки;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура НазначитьВстречу(ЭлементыФормы, ЭтаФорма, ЭтотОбъект) Экспорт
	
	ДанныеСтроки = ЭлементыФормы.ТабличноеПолеЗаявкиКандидатов.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено ИЛИ ДанныеСтроки.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиКандидатов.ФизЛицо,
	|	ЗаявкиКандидатов.Ответственный.ФизЛицо
	|ИЗ
	|	Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов
	|ГДЕ
	|	ЗаявкиКандидатов.Ссылка = &ЗаявкаКандидата";
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ДанныеСтроки.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Форма = Документы.Встречи.ПолучитьФормуНовогоДокумента(, ЭтаФорма, ЭтотОбъект);
	
	Форма.ВстречаСКандидатом	= Истина;
	Форма.ЗаявкаКандидата		= ДанныеСтроки.Ссылка;
	
	Если Выборка.Следующий() Тогда
		Если Не Выборка.Физлицо.Пустая() Тогда
			Форма.Участники.Добавить().Физлицо = Выборка.Физлицо;
		КонецЕсли;
		Если Выборка.ОтветственныйФизлицо <> NULL И Не Выборка.ОтветственныйФизлицо.Пустая() Тогда
			Форма.Участники.Добавить().Физлицо = Выборка.ОтветственныйФизлицо;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа
